In [2]:
!conda list | grep pandas

'grep'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [3]:
import pandas as pd

In [5]:
df = pd.read_csv('friend_list.txt')

In [6]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [8]:
df = pd.read_csv('friend_list_tab.txt')

In [9]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [11]:
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t') #구분되는 것이 탭(\t)이다

In [12]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
df = pd.read_csv('friend_list_no_head.csv') #헤더이야기가 없어서, 1열이 헤더로 잡힘

In [14]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [15]:
df = pd.read_csv('friend_list_no_head.csv', header = None) #헤더가 없음을 명시

In [16]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [17]:
df.columns = ['name','age','job'] #헤더에 이름 넣어주기

In [18]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names = ['name','age','job'])
#한번에 하는 법

In [20]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern